"use strict";
exports.CASETYPES = [
    {
        "id": "01",
        "name": "路燈維護",
        "subItems": [
            {
                "id": "01",
                "name": "故障不亮"
            },
            {
                "id": "02",
                "name": "白天未熄"
            },
            {
                "id": "03",
                "name": "路燈毀損",
            },
            {
                "id": "04",
                "name": "路燈遷移"
            },
            {
                "id": "05",
                "name": "其他事項"
            }
        ]
    },
    {
        "id": "02",
        "name": "道路維護",
        "subItems": [
            {
                "id": "01",
                "name": "道路凹陷坑洞"
            },
            {
                "id": "02",
                "name": "施工回填不實",
            },
            {
                "id": "03",
                "name": "路面嚴重老化龜裂",
            },
            {
                "id": "04",
                "name": "地下道、路面積水(或暴雨路面積水)",
            },
            {
                "id": "05",
                "name": "路面油漬(或油漆)",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "03",
        "name": "公園、綠地行道樹維護",
        "subItems": [
            {
                "id": "01",
                "name": "公園、綠地、安全島髒亂"
            },
            {
                "id": "02",
                "name": "公園、綠地設施損毀",
            },
            {
                "id": "03",
                "name": "路樹傾倒",
            },
            {
                "id": "04",
                "name": "路樹修剪",
            },
            {
                "id": "05",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "04",
        "name": "人行道損毀維護",
        "subItems": [
            {
                "id": "01",
                "name": "破損凹陷"
            },
            {
                "id": "02",
                "name": "因管線施工回填不實",
            },
            {
                "id": "03",
                "name": "人行道髒亂",
            },
            {
                "id": "04",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "05",
        "name": "下水道工程及排水溝維護",
        "subItems": [
            {
                "id": "01",
                "name": "排水溝疏通"
            },
            {
                "id": "02",
                "name": "溝蓋破損",
            },
            {
                "id": "03",
                "name": "溝蓋遺失",
            },
            {
                "id": "04",
                "name": "下水道工程維護",
            },
            {
                "id": "05",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "06",
        "name": "垃圾處理",
        "subItems": [
            {
                "id": "01",
                "name": "路面垃圾"
            },
            {
                "id": "02",
                "name": "垃圾清運",
            },
            {
                "id": "03",
                "name": "違規小廣告、旗幟",
            },
            {
                "id": "04",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "07",
        "name": "噪音、污染處理",
        "subItems": [
            {
                "id": "01",
                "name": "噪音"
            },
            {
                "id": "02",
                "name": "空氣污染",
            },
            {
                "id": "03",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "08",
        "name": "交通號(標)誌維護",
        "subItems": [
            {
                "id": "01",
                "name": "號誌故障"
            },
            {
                "id": "02",
                "name": "號誌毀損",
            },
            {
                "id": "03",
                "name": "標誌毀損(如反射鏡等)",
            },
            {
                "id": "04",
                "name": "標線補繪、塗銷(如紅線、黃線、停車格等)",
            },
            {
                "id": "05",
                "name": "號誌秒差調整()號誌不順暢",
            },
            {
                "id": "06",
                "name": "增(減)設號誌",
            },
            {
                "id": "07",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "09",
        "name": "路霸排除",
        "subItems": [
            {
                "id": "01",
                "name": "佔用道路"
            },
            {
                "id": "02",
                "name": "違規停車",
            },
            {
                "id": "03",
                "name": "以行動、言語禁止他人停車",
            },
            {
                "id": "04",
                "name": "有牌廢棄車",
            },
            {
                "id": "05",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "10",
        "name": "戶政、區政類",
        "subItems": [
            {
                "id": "01",
                "name": "空地管理"
            },
            {
                "id": "02",
                "name": "殯葬業務",
            },
            {
                "id": "03",
                "name": "集團結婚",
            },
            {
                "id": "04",
                "name": "戶政管理",
            },
            {
                "id": "05",
                "name": "宗教禮俗",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "11",
        "name": "市有財產管理",
        "subItems": [
            {
                "id": "01",
                "name": "市有土地管理"
            },
            {
                "id": "02",
                "name": "市有非公用土地租.佔.售",
            },
            {
                "id": "03",
                "name": "市有財產出租、出售",
            },
            {
                "id": "04",
                "name": "稅務管理",
            },
            {
                "id": "05",
                "name": "金融管理",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "12",
        "name": "教育類",
        "subItems": [
            {
                "id": "01",
                "name": "教師介聘、甄選"
            },
            {
                "id": "02",
                "name": "校園管理",
            },
            {
                "id": "03",
                "name": "補教問題",
            },
            {
                "id": "04",
                "name": "體育活動及場務管理",
            },
            {
                "id": "05",
                "name": "圖書館管理",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "13",
        "name": "社會福利救助類",
        "subItems": [
            {
                "id": "01",
                "name": "社會救助"
            },
            {
                "id": "02",
                "name": "社會福利",
            },
            {
                "id": "03",
                "name": "家暴事件",
            },
            {
                "id": "04",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "14",
        "name": "衛生醫療行政類",
        "subItems": [
            {
                "id": "01",
                "name": "防疫業務"
            },
            {
                "id": "02",
                "name": "醫藥管理",
            },
            {
                "id": "03",
                "name": "食品衛生",
            },
            {
                "id": "04",
                "name": "保健服務",
            },
            {
                "id": "05",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "15",
        "name": "消防安全",
        "subItems": [
            {
                "id": "01",
                "name": "消防設備問題"
            },
            {
                "id": "02",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "16",
        "name": "捷運工程類",
        "subItems": [
            {
                "id": "01",
                "name": "交通維護"
            },
            {
                "id": "02",
                "name": "工地管理",
            },
            {
                "id": "03",
                "name": "捷運行政",
            },
            {
                "id": "04",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "17",
        "name": "勞工行政類",
        "subItems": [
            {
                "id": "01",
                "name": "求職、徵才"
            },
            {
                "id": "02",
                "name": "勞資糾紛",
            },
            {
                "id": "03",
                "name": "勞工福利",
            },
            {
                "id": "04",
                "name": "工會組織",
            },
            {
                "id": "05",
                "name": "外勞業務",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "18",
        "name": "網路、資訊服務",
        "subItems": [
            {
                "id": "01",
                "name": "無線網路問題"
            },
            {
                "id": "02",
                "name": "市府網頁問題",
            },
            {
                "id": "03",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "19",
        "name": "違章建管業務",
        "subItems": [
            {
                "id": "01",
                "name": "ㄧ般違建"
            },
            {
                "id": "02",
                "name": "基地台設置問題",
            },
            {
                "id": "03",
                "name": "公寓大廈管理",
            },
            {
                "id": "04",
                "name": "不明纜線倒掛建築物上",
            },
            {
                "id": "05",
                "name": "既成巷道認定",
            },
            {
                "id": "06",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "20",
        "name": "工商、觀光、建設管理類",
        "subItems": [
            {
                "id": "01",
                "name": "招商業務"
            },
            {
                "id": "02",
                "name": "工商管理",
            },
            {
                "id": "03",
                "name": "農林畜牧業",
            },
            {
                "id": "04",
                "name": "公用事業",
            },
            {
                "id": "05",
                "name": "觀光業務",
            },
            {
                "id": "06",
                "name": "風景區管理",
            },
            {
                "id": "07",
                "name": "市場攤販管理",
            },
            {
                "id": "08",
                "name": "農林畜牧業",
            },
            {
                "id": "09",
                "name": "無照違規營業",
            },
            {
                "id": "10",
                "name": "流浪犬、貓問題",
            },
            {
                "id": "11",
                "name": "其他事項",
            }
        ]
    },
    {
        "id": "90",
        "name": "非屬前述各類的其他事項",
        "subItems": [
            {
                "id": "99",
                "name": "其他事項",
            }
        ]
    }
];
//# sourceMappingURL=mock-casetypes.js.map